app/views/events/show.html.erb

SELECT "tickets".* FROM "tickets" WHERE "tickets"."event_id" = ?  [["event_id", 1]]
---
<h1><%= "Event Name: "+ @event.name.to_s %></h1>
<% @event.tickets.each do |ticket|%>